BC_sensitivity/uniform_inlet/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// FDA Nozzle Benchmark - Case 1 (Re = 500, Laminar)
// Kinematic pressure (p/rho)

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    wallInlet
    {
        type            zeroGradient;
    }
    
    wallCollector
    {
        type            zeroGradient;
    }
    
    wallThroat
    {
        type            zeroGradient;
    }
    
    wallOutlet
    {
        type            zeroGradient;
    }
    
    stepExpansion
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
